Repository: Maysam00Haj/2022b-Quizard
Catalog: lib/localization/l10n/app_*.arb
Languages: ar, he

# loginToAccount
source: Please login to your account
ar: ادخل حسابك من فضلك
he: אנא כנס לחשבונך

source: Log in
ar: تسجيل الدخول
he: התחבר

source: OR
ar: او
he: או

source: Continue with Google
ar: اكمل مع حساب جوجل
he: המשך עם חשבון גוגל

source: Continue with Facebook
ar: اكمل مع حساب فيسبوك
he: המשך עם חשבון פייסבוק

source: Sign Up
ar: قم بانشاء حساب
he: יצירת חשבון חדש

# noAccount
source: Don't have an account?
ar: لا تملك حساب؟
he: אין חשבון?

# usernameOrEmail
source: Username / Email
ar: الاسم / البريد الالكتروني
he: שם משתמש / אימייל

source: Password
ar: كلمة السر
he: סיסמה

source: Repeat password
ar: اعد كتابة كلمة السر
he: הזן שוב את הסיסמה

source: FRIENDS
ar: الاصدقاء
he: חברים

source: Players
ar: اللاعبين
he: שחקנים

source: QUESTIONS
ar: الاسئلة
he: שאלות

source: Question
ar: سؤال
he: שאלה

source: Answer
ar: اجابة
he: תשובה

# questions1
source: questions
ar: اسئلة
he: שאלות

# question1
source: question
ar: سؤال
he: שאלה

source: SETTINGS
ar: الاعدادات
he: הגדרות

# addQuestionsCustom
source: Add questions here for custom games.
ar: قم باضافة اسئلة للالعاب المخصصة.
he: הוסף שאלות למשחקים בהתאמה אישית.

# addYourQuestion
source: Add Question
ar: اضف سؤالًا
he: הוסף שאלה

source: Delete Question
ar: حذف سؤال
he: מחק שאלה

# confirmDeletion
source: Are you sure you wish to delete this question?
ar: اانت متأكد من القيام بحذف السؤال؟
he: אתה בטוח שברצונך למחוק את השאלה?

source: DELETE
ar: حذف
he: מחק

source: CANCEL
ar: الغاء
he: ביטול

# cancel2
source: Cancel
ar: الغاء
he: בטל

source: Category
ar: الفئة
he: קטגוריה

source: Submit
ar: اكمل
he: בצע

source: Username
ar: اسم المستخدم
he: שם משתמש

source: Email
ar: البريد الالكتروني
he: אימייל

# finishSignUp
source: Finish signing up
ar: اكمال التسجيل
he: הירשם

# snackBar1
source: Email/Username already exists.
ar: البريد الالكتروني / اسم المستخدم موجود.
he: שם משתמש / אימייל נמצא כבר במערכת.

# snackBar2
source: All fields are required!
ar: كل الحقول ضرورية!
he: כל השדות נחוצים!

# snackBar3
source: Enter a valid email.
ar: ادخل بريد الكتروني صالح.
he: יש לציין כתובת דואר אלקטרוני חוקית.

# snackBar4
source: Passwords do not match!
ar: كلمات السر مختلفة!
he: סיסמאות שונות!

# snackBar5
source: Password should contain at least 6 characters.
ar: على كلمات السر ان تحتوي على 6 منازل او اكثر.
he: הסיסמה חייבת לכלול לפחות 6 תווים.

# snackBar6
source: Not enough questions to build a game
ar: الاسئلة التي اخترتها غير كافية لبناء اللعبة
he: לא בחרת מספיק קטגוריות!

# snackBar7
source: Swipe left to edit, and swipe right to delete
ar: مرر لليسار من اجل التعديل ولليمين من اجل الحذف
he: גלול שמאלה כדי לערוך או גלול ימינה כדי למחוק

# snackBar8
source: Psst, that's the correct answer
ar: لا تخبر احد! هذه هي الاجابة الصحيحة
he: פססט, זאת התשובה הנכונה

# snackBar9
source: The account already exists with Facebook credentials. please sign in via Facebook
ar: الحساب موجود كحساب فيسبوك. قم بادخال حساب فيسبوك.
he: החשבון קיים כחשבון פייסבוק. היכנס דרך פייסבוק.

# snackBar10
source: The account already exists try signing in using email and password
ar: الحساب موجود! قم بالدخول لحسابك.
he: החשבון קיים במערכת

# snackBar11
source: The account already exists with Google credentials. please sign in via Google
ar: لحساب موجود كحساب جوجل. قم بادخال حساب جوجل.
he: החשבון קיים כחשבון גוגל. היכנס דרך גוגל.

# snackBar13
source: The account already exists with a different credential.
ar: الحساب موجود لكن كلمة المرور غير صحيحة. حاول الدخول لحسابك.
he: החשבון קיים במערכת. נסה שוב עם סיסמה אחרת.

# snackBar14
source: Error occurred while accessing credentials. Try again.
ar: حصل خطأ ما. حاول مرة اخرى
he: אירעה שגיאה. אנא נסה שוב.

# snackBar15
source: Error occurred using Google Sign-In. Try again.
ar: حصل خطأ ما. حاول مرة اخرى
he: אירעה שגיאה בכניסה דרך גוגל. אנא נסה שוב.

# snackBar16
source: The account already exists with a different credential.
ar: الحساب موجود لكن كلمة المرور غير صحيحة. حاول الدخول لحسابك.
he: החשבון קיים במערכת. נסה שוב עם סיסמה אחרת.

# snackBar18
source: Error occurred using Facebook Sign-In. Try again.
ar: حصل خطأ ما. حاول مرة اخرى.
he: אירעה שגיאה בכניסה דרך פייסבוק. אנא נסה שוב.

# snackBar20
source: Usernames should contain 1-12 characters
ar: على الاسم الشخصي ان يكون بين 1-12 منازل
he: השם משתמש חייב להיות בין 1-12 תווים

# snackBar21
source: Usernames shouldn't contain '@'
ar: على الاسم الشخصي الا يحتوي على'@'
he: השם משתמש לא יכול לכלול '@'

# snackBar22
source: There should be at least 2 players
ar: على اللعبة ان تحتوي على لاعبين على الاقل
he: על המשחק להכיל לפחות שני שחקנים

# snackBar23
source: Email can't be empty
ar: على البريد الالكتروني ان يحتوي على منازل
he: האימייל חייב להכיל תווים

# snackBar24
source: Email must be valid
ar: البريد الالكتروني غير صحيح
he: האימייל חייב להיות תקין

# snackBar25
source: Email already exists
ar: البريد الالكتروني موجود
he: האימייל נמצא כבר במערכת

# snackBar26
source: Username can't be empty
ar: على الاسم الشخصي ان يحتوي على منازل
he: השם משתמש חייב להכיל תווים

# snackBar27
source: Username can't have '@' in it
ar: على الاسم الشخصي الا يحتوي على'@'
he: השם משתמש לא יכול לכלול '@'

# passwordChanged
source: Changed password successfully
ar: قمت بتغيير كلمة السر بنجاح
he: סיסמתך שונתה בהצלחה!

# somethingIsWrong
source: Something went wrong
ar: حدث خطأ ما
he: משהו השתבש.

# selectAvatar
source: Select your avatar by clicking the photo below
ar: انقر على الايقونة لاختيار صورة جديدة
he: בחר את תמונת הפרופיל שלך על ידי לחיצה על האייקון למטה.

source: Goal
ar: الهدف
he: מטרה

# infoText1
source: The player with the highest score wins.
ar: الفائز هو من يجمع اكبر عدد من النقاط.
he: השחקו עם הניקוד הכי גבוה מנצח.

# infoText2
source: -Each player enters a false answer.
ar: -على كل لاعب ادخال اجابة خاطئة.
he: -כל שחקן מכניס תשובה שגויה.

# infoText3
source: -All the false answers are shown with the right answer to all players.
ar: -تعرض الاجابات الخاطئة على اللاعبين بالاضافة للاجابة الصحيحة.
he: -כל התשובות השגויות יחד עם התשובה הנכונה מוצגים לשחקנים.

# infoText4
source: -Players are rewarded with points for choosing the right answer.
ar: -يحصل اللاعب على نقاط عند اختياره الاجابة الصحيحة.
he: -השחקנים מקבלים נקודות על בחירת תשובה נכונה.

# infoText5
source: -Players are rewarded with points for every player choosing their false answer.
ar: -يحصل اللاعب على نقاط عند اختيار اللاعبين الاخرين اجابته الخاطئة.
he: -השחקנים מקבלים נקודות על כל בחירה של שחקנים אחרים לתשובה השגויה שלהם.

# infoText6
source: -Players are rewarded for choosing the right answer multiple times in a row.
ar: -يحصل اللاعب على نقاط عند اختياره الاجابة الصحيحة عدة مرات على التوالي.
he: -השחקנים מקבלים נקודות על בחירת התשובה הנכונה מספר פעמים ברצף.

# infoText7
source: -Faster answer means more points.
ar: -كلما كانت اجابتك اسرع ستحصل على عدد اكبر من النقاط.
he: -תשובה מהירה יותר מקבלת יותר נקודות.

# infoText8
source: -You will get a number of points equal to the seconds in your timer for every correct answer.
ar: -ستحصل على نفس عدد الثواني المتبقية لديك عند اختيارك الاجابة الصحيحة.
he: -תקבל מספר נקודות כמספר השניות בטיימר שלך על כל בחירה נכונה.

# infoText9
source: -If someone chose your answer, you will get a number of points equal to the seconds in their timer.
ar: -عند اختيار احد ما اجابتك, ستحصل على نفس عدد الثواني المتبقية لديه.
he: -אם מישהו בוחר בתשובה שלך, תקבל מספר נקודות כמספר השניות בטיימר שלו.

# infoText10
source: -If you answer correctly multiple times in a row, you will get 10 points multiplied by the same number of the times in a row you answered correctly.
ar: -عند اختيارك للاجابة الصحيحة اكثر من مرة على التوالي, سوف تحصل في كل مرة على 10 نقاط مضروبة في عدد المرات المتتالية.
he: -אם אתה בוחר בתשובה הנכונה מספר פעמים ברצף, אתה תקבל 10 נקודות כפול אותו מספר של פעמים שענית נכון ברצף.

source: Round Gameplay
ar: وصف الجولة
he: מהלך המשחק

source: Bonuses
ar: نقاط اضافية
he: בונוסים

# calcPoints
source: Game Score Calculator
ar: حساب النقاط
he: חישוב הנקודות

source: Wins
ar: انتصارات
he: נצחונות

source: Rank
ar: رُتبة
he: דרגה

source: DAILY
ar: يومي
he: יומי

source: MONTHLY
ar: شهري
he: חודשי

source: ALL TIME
ar: كل الاوقات
he: בכל הזמנים

source: Ready
ar: مستعد
he: מוכן

source: Start Game
ar: ابدأ اللعبة
he: התחלת המשחק

source: Close Game
ar: انهاء اللعبة
he: סגור את המשחק

# closingAlert
source: Are you sure you wish to close this game? All current participants will be kicked automatically
ar: اانت متاكد من اغلاق اللعبة? سوف يُطرد جميع اللاعبون الاخرون تلقائيًا
he: אתה בטוח שברצונך לסגור את המשחק? כל השחקנים יורחקו אוטומטית מהמשחק

source: CHAT
ar: محادثة
he: צ'אט

# customCategory
source: Custom Categories
ar: الفئات المخصصة
he: קטגוריות בהתאמה אישית

# message1
source: Type and search any categories by users
ar: ابحث عن فئات خاصة باللاعبين
he: חפש קטגוריות של שחקנים

# officialCategory
source: Official Categories
ar: الفئات الرسمية
he: קטגוריות רשמיות

# message2
source: Scroll right for more categories
ar: مرر الشريط لليمين لفئات اخرى
he: בחר בעוד קטגוריות על ידי גלילה ימינה

source: Type here...
ar: اكتب هنا...
he: להקליד כאן...

source: Change Language
ar: تغيير اللغة
he: שינוי שפה

source: Change Avatar
ar: تغيير الصورة الشخصية
he: שינוי תמונה אישית

source: Change Username
ar: تغيير اسم المستخدم
he: שינוי שם משתמש

source: Change Email
ar: تعيير البريد الالكتروني
he: שינוי אימייל

source: Change Password
ar: تغيير كلمة السر
he: שינוי סיסמה

source: Log Out
ar: الخروج
he: התנתקות

source: Good luck,
ar: بالنجاح
he: בהצלחה,

source: About
ar: اقرأ المزيد
he: אודות

source: Profile
ar: الصفحة الشخصية
he: פרופיל

source: Play
ar: الألعاب
he: משחק

source: Leaderboard
ar: قائمة المتصدرين
he: לוח שיאים

# waitForOthers
source: Waiting for other players...
ar: انتظر اللاعبين الاخرين...
he: המתן להשחקנים האחרים...

# enterPin
source: Please enter a PIN Code
ar: ادخل رمز PIN من فضلك
he: הזן קוד זיהוי אישי

source: Join Game
ar: قم بالانضمام
he: הצטרף למשחק

# or2
source: OR
ar: او
he: או

# findOpenGame
source: Find me an open game
ar: ابحث لي عن لعبة
he: מצא לי משחק פתוח

source: YES
ar: نعم
he: כן

source: NO
ar: كلا
he: לא

source: Kick Player
ar: اطرد اللاعب
he: הרחק את השחקו

# wishToKick
source: Are you sure you wish to kick
ar: اانت متاكد من طرده؟
he: אתה בטוח שברצונך להרחיק את השחקן?

source: KICK
ar: اطرد
he: הרחק

source: Game Closed
ar: اللعبة مغلقة
he: המשחק סגור

# adminClosed
source: The admin closed the game
ar: المسؤول عن اللعبة قام باغلاقها
he: המנהל סגר את המשחק

source: CLOSE
ar: اغلق
he: סגור

# adminKick
source: You have been kicked by the admin from the game
ar: لقد قام المسؤول بطردك
he: מנהל המשחק הרחיק אותך

# wishToClose
source: Are you sure you wish to exit from this game?
ar: اانت متأكد من خروجك من اللعبة؟
he: אתה בטוח שברצונך לסגור את המשחק?

source: Wrong certificates
ar: بيانات خاطئة
he: הזנת פרטים לא נכונים

source: Edit Question
ar: قم بتعديل السؤال
he: ערוך את השאלה

# changedAvatar
source: Changed avatar successfully
ar: لقد قمت بتعيير الصورة الشخصية بنجاح
he: תמונת הפרופיל שונתה בהצלחה

# changedEmail
source: Changed email successfully
ar: لقد قمت بتعيير البريد الالكتروني بنجاح
he: האימייל שונה בהצלחה

# noCategories
source: No categories selected
ar: لم تفوم باختيار فئات
he: לא בחרת קטגוריות

# pin
source: PIN Code
ar: رمز PIN
he: קוד סודי

source: PIN CODE
ar: رمز PIN
he: קוד סודי

# enterFalseAnswer
source: Enter a false answer...
ar: ادخل اجابة خاطئة...
he: הזן תשובה שגויה...

source: Dismiss
ar: رفض
he: ביטול

source: UNLOCKED
ar: لعبة غير مقفلة
he: משחק פתוח

source: LOCKED
ar: لعبة مقفلة
he: משחק נעול

source: INVITE
ar: دعوة اللاعبين
he: הזמנת שחקנים

source: Score:
ar: نتيجة:
he: ניקוד:

# enterAnyCategory
source: Please enter any category
ar: اختر اية فئة
he: הזן קטגוריה כלשהי

# enterAnyQuestion
source: Please enter any question
ar: ادخل اية سؤال
he: הזן שאלה כלשהי

# enterAnyAnswer
source: Please enter any answer
ar: ادخل اية اجابة
he: הזן תשובה כלשהי

# passNotEmpty
source: Password can't be empty
ar: على كلمات السر ان تحتوي على 6 منازل او اكثر.
he: הסיסמה חייבת לכלול לפחות 6 תווים

# sixCharacters
source: 6 characters needed
ar: على كلمات السر ان تحتوي على 6 منازل او اكثر.
he: הסיסמה חייבת לכלול לפחות 6 תווים

# newPass
source: New Password
ar: كلمة سر جديدة
he: סיסמה חדשה

# noMatch
source: Password don't match
ar: كلمات السر غير متطابقة
he: הסיסמאות אינן זהות

# repeatNewPass
source: Repeat New Password
ar: اعد كتابة كلمة السر
he: הזן שוב את הסיסמה

# usernameExists
source: Username already exists
ar: اسم المستخدم مستعمل
he: השם משתמש קיים במערכת

# changedUsernameSucc
source: Changed username successfully
ar: قمت بتغيير اسم المستخدم بنجاح
he: השם משתמש שונה בהצלחה

# invalidPin
source: Invalid PIN Code
ar: رمز PIN غير صحيح
he: קוד סודי לא חוקי

source: Game is locked
ar: اللعبة مقفلة
he: המשחק נעול

source: Game is Full
ar: امتلأت اللعبة
he: המשחק מלא

# noPublicGames
source: Couldn't find any open public game
ar: لم نجد اي العاب متوفرة
he: לא מצאנו משחקים פנויים

# waitForPlayers
source: Waiting for more players...
ar: انتظر باقي اللاعبين...
he: המתן לשחקנים אחרים...

# gameWillStartSoon
source: The game will start soon.
ar: اللعبة ستبدأ في أي وقت الان.
he: המשחק מיד מתחיל.

source: End Game
ar: خروج
he: סיום

source: Copied
ar: نسخ
he: העתקת

source: to clipboard
ar: للشاشة
he: ללוח

# rounds3
source: 3 ROUNDS
ar: 3 جولات
he: 3 סיבובים

# rounds5
source: 5 ROUNDS
ar: 5 جولات
he: 5 סיבובים

# rounds7
source: 7 ROUNDS
ar: 7 جولات
he: 7 סיבובים

source: Game
ar: اللعبة
he: משחק

# players1
source: Players)
ar: اللاعبون)
he: שחקנים)

source: Game Exited
ar: أُغلقت اللعبة
he: המשחק נעצר

# kickReason
source: You were kicked from the game because your app has been paused.
ar: لقد طُردت من اللعبة لان اللعبة توقفت.
he: הורחקת מהמשחק בגלל שהמשחק נעצר.

source: OK
ar: حسنًا
he: בסדר

source: Bonus!
ar: اضافة!
he: בונוס!

source: Correct!
ar: صحيح!
he: נכון!
